reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "T2zyZRp6pE2ybIiGTBQIGg=="], ["updated_at", "2022-01-21 21:43:49.634545"], ["id", 2]]
---
	def reset_session_token!
		self.session_token= SecureRandom.base64(16)
		self.save!